20240217T002258--kdoc-96-errorsasの使い方__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:05:22Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 96: errors.As()の使い方</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 96: errors.As()の使い方</h1>
<div id="outline-container-org864face" class="outline-2">
<h2 id="org864face"><a href="#org864face">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org864face">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-17 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-25 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org025d6cb" class="outline-2">
<h2 id="org025d6cb"><a href="#org025d6cb">概要</a></h2>
<div class="outline-text-2" id="text-org025d6cb">
<p>
以前<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>のerrors.Is()を調べたので、今度はerrors.As()を調べる。違いは何だろうか。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>シグネチャ</label><pre class="src src-go">func As(err error, target any) bool
</pre>
</div>

<ul class="org-ul">
<li><a href="https://pkg.go.dev/errors#As">errors package - errors - Go Packages</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5c45fc9" class="outline-2">
<h2 id="org5c45fc9"><a href="#org5c45fc9">ユースケース</a></h2>
<div class="outline-text-2" id="text-org5c45fc9">
<p>
まずユースケースを見る。fs.PathErrorはUnwrap()、As()を実装してないので、エラーツリーを辿らず独自判定ロジックで実行しない。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>exampleから</label><pre class="src src-go">if _, err := os.Open("non-existing"); err != nil {
        var pathError *fs.PathError
        if errors.As(err, &amp;pathError) {
                fmt.Println("Failed at path:", pathError.Path)
        } else {
                fmt.Println(err)
        }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">Failed at path: non-existing
</pre>
</div>

<p>
errをpathErrorに代入しているように見える。それによって、変数pathErrorのフィールドに値が入って、使えるようになっている。エラーの中身を使いたいとき用ということか。
</p>

<p>
直接取り出せばいいのでは、と考えたがerr.Path
errはos.Open()が返したインターフェース型 <code>error</code> なので、まだ型が未確定。なのでerr.PathはUndefinedになる。型アサーションしてからだとフィールドへアクセスできるようになる。現在コードの状況に限定して、同じようなコードを型アサーションを使って書いた。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>型アサーションで書いた</label><pre class="src src-go">if _, err := os.Open("non-existing"); err != nil {
        var pathError *fs.PathError
        pathError, _ = err.(*fs.PathError)
        if pathError != nil {
                fmt.Println("Failed at path:", pathError.Path)
        } else {
                fmt.Println(err)
        }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">Failed at path: non-existing
</pre>
</div>

<p>
↑エラーツリーを辿らない、入力が限定されたもっともシンプルなケースでは、型アサーションでも同じ意味に見える。ただ、見やすさはよくなさそうだ。errors.As()は型アサーションと結果ブーリンアンの返却をシンプルにやってくれる関数、といえそうだ。
</p>

<p>
errors.Is()との違いは、代入を使っていることだ。errの中身を取り出すには、本質的にerrorインターフェースの型を確定して、ターゲットの型を持つ別な変数に代入する必要がある。errors.Is()では <code>==</code> を使って多くの場合ポインタによって、つまりメモリアドレスでエラーの種類を判断していた。したがってIs()で型は全く出てこなかった。As()では代入が関連するので型が重要そうに見える。
</p>

<p>
↓実装を見てみよう。本質的な部分はこのあたりか。
</p>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kd-collective/go/blob/b8ac61e6e64c92f23d8cf868a92a70d13e20a124/src/errors/wrap.go#L118-L121
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">if reflectlite.TypeOf(err).AssignableTo(targetType) {
	targetVal.Elem().Set(reflectlite.ValueOf(err))
	return true
}
</pre>
</div>

<p>
素朴に、err(Asの第1引数)の型がtarget(Asの第2引数)の型へ代入可能であれば、targetの値にerrの値をセットする、に見える。
</p>

<p>
では代入可能とはなにか、なぜ代入時に見慣れない書き方をしているのか、ということになるのだが、深遠なテーマになりそうなのでここでは進まない。
</p>
</div>
</div>
<div id="outline-container-orga3ace2f" class="outline-2">
<h2 id="orga3ace2f"><a href="#orga3ace2f">まとめ</a></h2>
<div class="outline-text-2" id="text-orga3ace2f">
<p>
Is()とAs()の違いをまとめる。
</p>

<ul class="org-ul">
<li>errors.Is()は単純にエラーを区別する関数。同値性によって判定。どうやって同値とするかは型によって異なるがおおむねポインタ型によるメモリアドレス判定が使われる</li>
<li>errors.As()はエラーを区別しつつ、型アサーションする関数。型の代入可能性によって判定。エラーのフィールドを利用したいときに使う</li>
</ul>
</div>
</div>
<div id="outline-container-orga4c33cf" class="outline-2">
<h2 id="orga4c33cf"><a href="#orga4c33cf">関連</a></h2>
<div class="outline-text-2" id="text-orga4c33cf">
<ul class="org-ul">
<li><a href="20240210T220439--kdoc-86-errorsisの比較ロジックを見る__wiki.html#ID-20240210T220439">KDOC 86: errors.Is()の比較ロジックを見る</a>。IsとAsがあるのはなぜか疑問を持ったので調べた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
